week6/d3/first_routes/app/controllers/artwork_shares_controller.rb

  def index
    share = ArtworkShare.all
---
SELECT "artwork_shares".* FROM "artwork_shares"

  def show
    artshare = ArtworkShare.find(params[:id])
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

 def create
      share = ArtworkShare.new(artwork_share_params)
      # replace the `user_attributes_here` with the actual attribute keys
      if share.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 4], ["viewer_id", 2], ["created_at", "2021-10-07 23:31:36.919634"], ["updated_at", "2021-10-07 23:31:36.919634"]]