week6/d3/first_routes/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks"
---
    def index
      artworks = Artwork.all

INSERT INTO "artworks" ("title", "artist_id", "image_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "f1"], ["artist_id", 1], ["image_url", "www.nascar.com"], ["created_at", "2021-10-07 22:18:44.603556"], ["updated_at", "2021-10-07 22:18:44.603556"]]
---
    def create
        # debugger
        artwork = Artwork.new(artwork_params)
        if artwork.save